Revit 2027 API
AlphanumericRevisionSettings Constructor
 Constructs an AlphanumericRevisionSettings with a simple, default sequence.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public AlphanumericRevisionSettings()
Public Sub New
public:
AlphanumericRevisionSettings()
new : unit -> AlphanumericRevisionSettings
Remarks
 The default sequence contains each letter of the alphabet (may differ based on language settings).
See Also
Reference
AlphanumericRevisionSettings Class
AlphanumericRevisionSettings Overload
Autodesk.Revit.DB Namespace